MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EV128GM006/mcu.h
#define SR1C SR1C
extern volatile uint16_t SR1C __attribute__((__sfr__));
typedef struct tagSR1CBITS {
  uint16_t :3;
  uint16_t SR1C3:1;
  uint16_t :2;
  uint16_t SR1C6:1;
  uint16_t SR1C7:1;
  uint16_t SR1C8:1;
  uint16_t SR1C9:1;
} SR1CBITS;
extern volatile SR1CBITS SR1Cbits __attribute__((__sfr__));

#define SR0C SR0C
extern volatile uint16_t SR0C __attribute__((__sfr__));
typedef struct tagSR0CBITS {
  uint16_t :3;
  uint16_t SR0C3:1;
  uint16_t :2;
  uint16_t SR0C6:1;
  uint16_t SR0C7:1;
  uint16_t SR0C8:1;
  uint16_t SR0C9:1;
} SR0CBITS;
extern volatile SR0CBITS SR0Cbits __attribute__((__sfr__));

#define TRISD TRISD
extern volatile uint16_t TRISD __attribute__((__sfr__));
typedef struct tagTRISDBITS {
  uint16_t :5;
  uint16_t TRISD5:1;
  uint16_t TRISD6:1;
  uint16_t :1;
  uint16_t TRISD8:1;
} TRISDBITS;
extern volatile TRISDBITS TRISDbits __attribute__((__sfr__));

#define PORTD PORTD
extern volatile uint16_t PORTD __attribute__((__sfr__));
typedef struct tagPORTDBITS {
  uint16_t :5;
  uint16_t RD5:1;
  uint16_t RD6:1;
  uint16_t :1;
  uint16_t RD8:1;
} PORTDBITS;
extern volatile PORTDBITS PORTDbits __attribute__((__sfr__));

#define LATD LATD
extern volatile uint16_t LATD __attribute__((__sfr__));
typedef struct tagLATDBITS {
  uint16_t :5;
  uint16_t LATD5:1;
  uint16_t LATD6:1;
  uint16_t :1;
  uint16_t LATD8:1;
} LATDBITS;
extern volatile LATDBITS LATDbits __attribute__((__sfr__));

#define ODCD ODCD
extern volatile uint16_t ODCD __attribute__((__sfr__));
typedef struct tagODCDBITS {
  uint16_t :5;
  uint16_t ODCD5:1;
  uint16_t ODCD6:1;
  uint16_t :1;
  uint16_t ODCD8:1;
} ODCDBITS;
extern volatile ODCDBITS ODCDbits __attribute__((__sfr__));

#define CNEND CNEND
extern volatile uint16_t CNEND __attribute__((__sfr__));
typedef struct tagCNENDBITS {
  uint16_t :5;
  uint16_t CNIED5:1;
  uint16_t CNIED6:1;
  uint16_t :1;
  uint16_t CNIED8:1;
} CNENDBITS;
extern volatile CNENDBITS CNENDbits __attribute__((__sfr__));

#define CNPUD CNPUD
extern volatile uint16_t CNPUD __attribute__((__sfr__));
typedef struct tagCNPUDBITS {
  uint16_t :5;
  uint16_t CNPUD5:1;
  uint16_t CNPUD6:1;
  uint16_t :1;
  uint16_t CNPUD8:1;
} CNPUDBITS;
extern volatile CNPUDBITS CNPUDbits __attribute__((__sfr__));

#define CNPDD CNPDD
extern volatile uint16_t CNPDD __attribute__((__sfr__));
typedef struct tagCNPDDBITS {
  uint16_t :5;
  uint16_t CNPDD5:1;
  uint16_t CNPDD6:1;
  uint16_t :1;
  uint16_t CNPDD8:1;
} CNPDDBITS;
extern volatile CNPDDBITS CNPDDbits __attribute__((__sfr__));

#define TRISE TRISE
extern volatile uint16_t TRISE __attribute__((__sfr__));
typedef struct tagTRISEBITS {
  uint16_t :12;
  uint16_t TRISE12:1;
  uint16_t TRISE13:1;
  uint16_t TRISE14:1;
  uint16_t TRISE15:1;
} TRISEBITS;
extern volatile TRISEBITS TRISEbits __attribute__((__sfr__));

#define PORTE PORTE
extern volatile uint16_t PORTE __attribute__((__sfr__));
typedef struct tagPORTEBITS {
  uint16_t :12;
  uint16_t RE12:1;
  uint16_t RE13:1;
  uint16_t RE14:1;
  uint16_t RE15:1;
} PORTEBITS;
extern volatile PORTEBITS PORTEbits __attribute__((__sfr__));

#define LATE LATE
extern volatile uint16_t LATE __attribute__((__sfr__));
typedef struct tagLATEBITS {
  uint16_t :12;
  uint16_t LATE12:1;
  uint16_t LATE13:1;
  uint16_t LATE14:1;
  uint16_t LATE15:1;
} LATEBITS;
extern volatile LATEBITS LATEbits __attribute__((__sfr__));

#define ODCE ODCE
extern volatile uint16_t ODCE __attribute__((__sfr__));
typedef struct tagODCEBITS {
  uint16_t :12;
  uint16_t ODCE12:1;
  uint16_t ODCE13:1;
  uint16_t ODCE14:1;
  uint16_t ODCE15:1;
} ODCEBITS;
extern volatile ODCEBITS ODCEbits __attribute__((__sfr__));

#define CNENE CNENE
extern volatile uint16_t CNENE __attribute__((__sfr__));
typedef struct tagCNENEBITS {
  uint16_t :12;
  uint16_t CNIEE12:1;
  uint16_t CNIEE13:1;
  uint16_t CNIEE14:1;
  uint16_t CNIEE15:1;
} CNENEBITS;
extern volatile CNENEBITS CNENEbits __attribute__((__sfr__));

#define CNPUE CNPUE
extern volatile uint16_t CNPUE __attribute__((__sfr__));
typedef struct tagCNPUEBITS {
  uint16_t :12;
  uint16_t CNPUE12:1;
  uint16_t CNPUE13:1;
  uint16_t CNPUE14:1;
  uint16_t CNPUE15:1;
} CNPUEBITS;
extern volatile CNPUEBITS CNPUEbits __attribute__((__sfr__));

#define CNPDE CNPDE
extern volatile uint16_t CNPDE __attribute__((__sfr__));
typedef struct tagCNPDEBITS {
  uint16_t :12;
  uint16_t CNPDE12:1;
  uint16_t CNPDE13:1;
  uint16_t CNPDE14:1;
  uint16_t CNPDE15:1;
} CNPDEBITS;
extern volatile CNPDEBITS CNPDEbits __attribute__((__sfr__));

#define ANSELE ANSELE
extern volatile uint16_t ANSELE __attribute__((__sfr__));
typedef struct tagANSELEBITS {
  uint16_t :12;
  uint16_t ANSE12:1;
  uint16_t ANSE13:1;
  uint16_t ANSE14:1;
  uint16_t ANSE15:1;
} ANSELEBITS;
extern volatile ANSELEBITS ANSELEbits __attribute__((__sfr__));

#define TRISF TRISF
extern volatile uint16_t TRISF __attribute__((__sfr__));
typedef struct tagTRISFBITS {
  uint16_t TRISF0:1;
  uint16_t TRISF1:1;
} TRISFBITS;
extern volatile TRISFBITS TRISFbits __attribute__((__sfr__));

#define PORTF PORTF
extern volatile uint16_t PORTF __attribute__((__sfr__));
typedef struct tagPORTFBITS {
  uint16_t RF0:1;
  uint16_t RF1:1;
} PORTFBITS;
extern volatile PORTFBITS PORTFbits __attribute__((__sfr__));

#define LATF LATF
extern volatile uint16_t LATF __attribute__((__sfr__));
typedef struct tagLATFBITS {
  uint16_t LATF0:1;
  uint16_t LATF1:1;
} LATFBITS;
extern volatile LATFBITS LATFbits __attribute__((__sfr__));

#define ODCF ODCF
extern volatile uint16_t ODCF __attribute__((__sfr__));
typedef struct tagODCFBITS {
  uint16_t ODCF0:1;
  uint16_t ODCF1:1;
} ODCFBITS;
extern volatile ODCFBITS ODCFbits __attribute__((__sfr__));

#define CNENF CNENF
extern volatile uint16_t CNENF __attribute__((__sfr__));
typedef struct tagCNENFBITS {
  uint16_t CNIEF0:1;
  uint16_t CNIEF1:1;
} CNENFBITS;
extern volatile CNENFBITS CNENFbits __attribute__((__sfr__));

#define CNPUF CNPUF
extern volatile uint16_t CNPUF __attribute__((__sfr__));
typedef struct tagCNPUFBITS {
  uint16_t CNPUF0:1;
  uint16_t CNPUF1:1;
} CNPUFBITS;
extern volatile CNPUFBITS CNPUFbits __attribute__((__sfr__));

#define CNPDF CNPDF
extern volatile uint16_t CNPDF __attribute__((__sfr__));
typedef struct tagCNPDFBITS {
  uint16_t CNPDF0:1;
  uint16_t CNPDF1:1;
} CNPDFBITS;
